{
    "meals": [
        {
            "strFood": "ugali",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2021/05/ugali-on-a-plate.jpg",
            "strInstructions": "ingredients  4 cups water 2 cups plus  1 tablespoon if needed) of maize millet or sorghum flour (can be mixed with cassava flour Preparation Bring the water to a boil in a large pot then pour in some of the maize flour. Allow the water to keep boiling for a few minutes and then begin to turn the mixture with a long wooden spoon. Sprinkle in more flour and continue mixing. The mixture should start to thicken as you keep stirring and adding more flour.Now the work starts. Hold the pot with mittens or a cloth to prevent burning your hands and continue to fold the flour into itself. The ugali will become firmer and more difficult to turn. Press the ugali against the wall of the pot with the spoon then mix it back into the middle of the pot. Repeat this process several times. Let the ugali stay in the middle of the pot, and turn down the heat to low. After a few minutes press out and return the ugali to the middle of the pot again. Remove it from the heat.Scoop the ugali onto a plate and cover the plate with the pot for a few minutes as you dip the spoon into some water. When taken out of the pot, the ugali will be shapeless. Use the wet spoon to press the ugali until it is rounded. Serve with meat chicken fish or vegetables on the side.",
            "idMeal": "1",
            "strCategory": "ugali"
        },
        {
            "strFood": "ugali skuma",
            "strMealThumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Ugali_%26_Sukuma_Wiki.jpg/330px-Ugali_%26_Sukuma_Wiki.jpg",
            "strInstructions":  "Ingredients for Sukuma Wiki 16 ounces/1 pound of collard greens  1/4 cup vegetable oil 1 onion (diced) 2 tomatoes (diced)  1 cup of water  Cinnamon Garlic Powder  Ginger Powder Turmeric Powder Recipe Preparation Using the chiffonade method cut the collard greens into thin strips and set aside. Put oil in a medium saucepan and add the diced onions. Using medium-high heat cook onions until golden brown. Add diced tomatoes and stir until fully incorporated. Cook for two minutes (the mixture will start to thicken). Add the collard greens and stir until fully incorporated. Cover with lid and cook for five minutes.In a separate small bowl mix water with a pinch of cinnamon garlic powder ginger powder turmeric powder. Mix well with a small whisk or fork until all of the ingredients dissolve. Pour half the spice mix into the saucepan and stir until fully incorporated. Cover with lid and cook for an additional five minutes.Remove from heat keep covered and let rest while you cook your ugali.In the medium saucepan bring water to a rolling boil. Remove half the water and set aside. Add the corn meal to the boiling water. Let it cook for 15 seconds. You will see that the water starts to cover the corn meal. Using a wooden spoon or spatula stir to combine the ingredients. Little by little add the reserved water to your saucepan while stirring.NOTE: Traditional Kenyan ugali is quite dense like a thick paste. If you'd like a looser consistency to your ugali then add more water to the saucepan. Reduce heat to medium and keep stirring. You'll notice that the water is absorbed and that the ugali starting to stick together. Gather the ugali into a mound in the center of the saucepan. Let it continue to cook for two additional minutes.",
            "idMeal": "2",
            "strCategory": "main meal"
        },
        {
            "strFood": "ugali nyama",
            "strMealThumb": "https://media.istockphoto.com/id/670563758/photo/grilled-lamb-meat-with-tomato-salad-and-ugali.jpg?s=612x612&w=0&k=20&c=F502j4V5oG5tOXMMb1WZLOu8VdlOMoNiuOUDOCAY9BI=",
            "strInstructions":  "preparation: Heat oil in a heavy based pot. Add the onions and stir. Cook for 30 seconds or until translucent. Stir in the garlic and curry powder. Add the beef cubes, salt, pepper, tomatoes and water and stir. Cover the pot with a lid and let simmer for 30-40 minutes. Garnish with coriander leaves and set aside while you prepare the ugali. Bring the water to boil in a pot/sufuria. Add 1/2 cup maize flour to the boiling water. Adding a little bit of the flour to the water ensures that the water starts to ‘roar’ which makes the perfect ugali. Stir using a wooden spatula and try to break any lumps apart. Add the remaining flour and get stirring. Using the spatula, smoothen out any lumps that may have formed. If the ugali is not hard enough, add more flour. Lower the heat and keep working the ugali against the sides of the pot, getting rid of any lumps and also making sure it is evenly cooked. Once cooked, mould it using the spatula and serve with a serving of beef stew.  ",
            "idMeal": "3",
            "strCategory": "Nyama"

        },
        {
            "strFood": "pilau",
            "strMealThumb": "https://bigoven-res.cloudinary.com/image/upload/t_recipe-256/kenyan-chicken-pilau-east-afri-24a419-982791286b08d760e995e098.jpg",
            "strInstructions":  "Ingredients 1 Large Onion chopped 2-3 Garlic cloves crushed A little ginger crushed 2-3 tablespoons ground Pilau Masala (depending on one’s spice preference) 1/2 Kg cubed beef 4 Tomatoes(finely diced or blended) or 450 g tomato paste 2 Cups Rice 3 Cups Hot Water Salt to taste Cooking oil as required (2-2.5 tablespoons) Method Heat oil in a sufuria,add in the onion and ginger. Let this cook over a medium flame until browned. Stir in the meat and replace lid over sufuria.Let the meat cook for about three minutes (the meat should be tender). If the meat has not softened allow it to cook for a few more minutes. Add pilau masala and salt while stirring continuously to ensure the spices are well-distributed. (You may also add a little water incase your meat is dry and sticking to the sufuria.) Add tomato paste and continue to stir. Add some water (2-3 teaspoons) and bring this to boil after covering the sufuria. The mixture should get the consistency of a thick sauce. Add the washed rice and mix well.Proceed to add the 3 cups of water, cover and let this boil over a medium flame for a few about 5 mins. Reduce the heat and allow the rice to simmer while covered.After about 5 minutes of cooking, give the rice a stir using a fork and cover. Repeat the stirring one or two more times to ensure the rice is cooking evenly and does not stick to bottom of sufuria. The rice should cook until all excess water has evaporated. Once ready, the dish may be accompanied with some kachumbari.  ",
            "idMeal": "4",
            "strCategory": "Rice"
        },
        {
            "strFood": "kuku kienyeji",
            "strMealThumb": "https://img-global.cpcdn.com/recipes/9fa35726c98226d9/680x482cq70/kienyeji-kuku-wet-fry-recipe-main-photo.webp",
            "strInstructions":  "1 Kienyeji chicken 1 Onion 3 Tomato 3 tbsps Tomato paste 3 Ginger 3 tbsps Dried rosemary To Taste Salt Vegetable oil Water Add chicken to the pan. Set the liver aside and add salt in the pan 2 Add the dried rosemary, ginger and water 3 Mix well and boil till tender. 4   Drain the broth from the chicken and set aside for later 5 In a different pan add a tablespoon of oil and onions and fry till golden brown 6 Add the tomatoes cook until it softens,add tomato paste then the chicken 7 Add back the chicken broth Add the liver that was set aside. It is cooked last because it takes a shorter time to cook 9 Simmer till liver cooks. Serve and enjoy. ",
            "idMeal": "5",
            "strCategory": "kuku"
        },
        {
            "strFood": "Ugali brown",
            "strMealThumb": "https://res.feednews.com/assets/v2/fbe8c2d5e44145c4b192f11a0d095713?width=450&height=336&quality=hq&category=ng_Food",
            "strInstructions":  "Ingredients of cooking brown ugali   500g millet/cassava flour 1 teaspoonful of cooking oil/butter 2 cups of water. Procedure preparing brown ugali Pour the water into a Sufuria and place over medium heat and bring it to a boil. Add the teaspoonful of cooking oil or butter and let it boil/melt for a minute. This is for the ugali not to turn too sticky. Add the flour in bits as you stir with a cooking stick until you get a heavy porridge like mixture. Let it boil for two minutes. Add the remaining floor in bits as you stir the mixture and press it against the sufuria to get rid of the flour lumps. You have to be consistent in your pressing for best results. Let the now hardned mixture cooking for two minutes before turning it over and letting it cook for another minute. Mold the ugali into a round lump and place a plate over the Sufuria and turn it over to place the ugali on the plate. Your brown ugali is now ready and is best served while hot. Serve with meat, beans and vegetables of your choice and enjoy. ",
            "idMeal": "6",
            "strCategory": "ugali"
        },
        {
            "strFood": "chapati",
            "strMealThumb": "https://bigoven-res.cloudinary.com/image/upload/h_320,w_320,c_fill/kenyan-soft-layered-chapati-79b30c5a09b4ac324db4637a.jpg",
            "strInstructions":  "INGREDIENTS 3 cups of flour 1 1/2 cups of warm water 1 tsp of salt 1 tsp of sugar INSTRUCTIONS 1. Add 3 cups of flour in a bowl. 2. Add salt, sugar, 2 tbsp of oil and 1 ½ cups of water in a separate jar/ bowl. Stir until the salt and sugar dissolves. 3. Add the liquid mixture in step 2 in the flour bowl (step 1) and mix well. 4. Keep kneading for 10 minutes and add flour if needed until the dough becomes non-sticky. Add 2-3 tbsp of oil and continue kneading until the oil mixes well and the dough is soft. Cover the dough and leave it for 40 minutes. 5. After the 40 minutes, divide the dough into 10 - 15 equal parts making ball like shapes. Arrange them in a flat surface dusted with flour(Cover with a damp tablecloth to avoid drying). 6. Dust flour in the flat place and take one of the balls and start rolling with a rolling pin to a circular shape, brush oil on top and roll it inwards to form a shape-like a rope, then create a coil-like shape and press the ball down with your palm to make it flat. Repeat this process to the rest of the remaining balls of dough. 7. Next, start rolling each of the coil-like shape doughs with the rolling pin to form a circular shape again. 8. In a hot pan, place the rolled out circular chapati and fry each side with little oil until its golden brown on medium heat. Place your cooked chapati in a flat plat and cover with an aluminum foil. 9. Repeat this step to the rest of the coil-like dough. ",
            "idMeal": "7",
            "strCategory": "chapati"
        },
        {
            "strFood": "mandazi",
            "strMealThumb": "https://bigoven-res.cloudinary.com/image/upload/t_recipe-256/mandazi-recipe-by-tasty-2365367.jpg",
            "strInstructions":  "INGREDIENTS 3 cups all-purpose flour, plus more for dusting ½ cup sugar 1 teaspoons baking powder 2 teaspoons ground cardamom ½ teaspoon kosher salt 1 egg ; beaten In a large bowl, whisk together the flour, sugar, baking powder, cardamom, and salt. Make a well in the center, then use a rubber spatula to mix in the egg and coconut milk until the dough comes together. Turn the dough out onto a floured surface and knead until smooth. Dive the dough into 4 portions. Roll out 1 portion of dough into a circle about ¼-inch (6 ml) thick. Cut into 8 triangles. Repeat with the remaining dough portions. Heat the oil in a large pot until it reaches 350˚F (180˚C). Working in batches, fry the mandazi for 2-3 minutes per side, until golden brown. Drain on paper towels. Serve as breakfast or a snack with 5. Kenyan coffee or chai. Enjoy! ",
            "idMeal": "8",
            "strCategory": "chapati"
        },
        {
            "strFood": "mahamri",
            "strMealThumb": "https://bigoven-res.cloudinary.com/image/upload/h_320,w_320,c_fill/kenya-mahamri-0d1c000f8b227c3e5a0bfc77.jpg",
            "strInstructions":  "INGREDIENTS    3 cups plain flour all purpose flour 1 tsp cardamom powder 1 tsp dry active instant yeast ½ cup sugar ¼ cup hot milk 1 cup coconut milk thick 2 tbsp ghee clarified butter or butter extra flour for dusting oil for deep frying INSTRUCTIONS   PREPARATION OF THE DOUGH: Sieve flour into a big bowl and mix in the cardamom powder and sugar. Add the instant yeast and mix well. Add 1 tbsp ghee and rub it into the flour. Mix the hot milk and coconut milk. Using the milk mixture, form a soft dough. Using the remaining butter or ghee, knead the dough for 5 minutes till it becomes smooth. Lightly grease a bowl. Place the dough in it. Cover with cling film and let the dough rise for about 1½ - 2 hours. Fermenting time will depend on how cold or warm your place is. ROLLING THE MAHAMRI: Sieve some flour onto baking sheets or trays sparingly. Knead the dough gently. Divide the dough into 8 parts. Roll each part into a ball. Roll out one ball into a 6  inch diameter circle, using some flour. Cut it into 4 parts using a sharp knife or a pizza cutter. Place the triangles onto the floured baking sheet or tray. Repeat with the remaining dough. FRYING MAHAMRI: Heat oil in a frying pan, wok or karai oer medium heat. Add a small piece of the dough into the hot oil. If it sizzles and comes up immedaitely then the oil is ready. When it is hot, place the triangles (3 to 4 at a time) in it gently and fry till they are golden brown. Remember not to fry them over high heat as they will brown quickly and the inside will remain raw. Remove the fried mahamri into a colander and repeat with the remaining triangles. Serve hot with any curry of your choice or some spicy tea or coffee.",
            "idMeal": "9",
            "strCategory": "chapati"
        },
        {
            "strFood": "Rice",
            "strMealThumb": "https://bigoven-res.cloudinary.com/image/upload/t_recipe-256/plain-white-rice-f7391e.jpg",
            "strInstructions":  "INGREDIENTS    3 cups plain flour all purpose flour 1 tsp cardamom powder 1 tsp dry active instant yeast ½ cup sugar ¼ cup hot milk 1 cup coconut milk thick 2 tbsp ghee clarified butter or butter extra flour for dusting oil for deep frying INSTRUCTIONS   PREPARATION OF THE DOUGH: Sieve flour into a big bowl and mix in the cardamom powder and sugar. Add the instant yeast and mix well. Add 1 tbsp ghee and rub it into the flour. Mix the hot milk and coconut milk. Using the milk mixture, form a soft dough. Using the remaining butter or ghee, knead the dough for 5 minutes till it becomes smooth. Lightly grease a bowl. Place the dough in it. Cover with cling film and let the dough rise for about 1½ - 2 hours. Fermenting time will depend on how cold or warm your place is. ROLLING THE MAHAMRI: Sieve some flour onto baking sheets or trays sparingly. Knead the dough gently. Divide the dough into 8 parts. Roll each part into a ball. Roll out one ball into a 6  inch diameter circle, using some flour. Cut it into 4 parts using a sharp knife or a pizza cutter. Place the triangles onto the floured baking sheet or tray. Repeat with the remaining dough. FRYING MAHAMRI: Heat oil in a frying pan, wok or karai oer medium heat. Add a small piece of the dough into the hot oil. If it sizzles and comes up immedaitely then the oil is ready. When it is hot, place the triangles (3 to 4 at a time) in it gently and fry till they are golden brown. Remember not to fry them over high heat as they will brown quickly and the inside will remain raw. Remove the fried mahamri into a colander and repeat with the remaining triangles. Serve hot with any curry of your choice or some spicy tea or coffee.",
            "idMeal": "10",
            "strCategory": "Rice"
        },
        {
            "strFood": "maharagwe",
            "strMealThumb": "https://bigoven-res.cloudinary.com/image/upload/t_recipe-256/16-bean-soup.jpg",
            "strInstructions":  "Soak the beans: I am a firm believer in soaking the beans if you have the time. It does help trim down the cooking time a bit, but even more importantly, pre-soaking helps the beans cook more evenly and become completely tender all the way through. Keep the beans at a simmer: Bring the beans to a boil at the very beginning of cooking to bring everything up to temperature, but then you want to keep the beans at a very gentle simmer for the rest of cooking. You should barely see movement in the water. Along with pre-soaking, simmering the beans gently helps them cook evenly until tender, retain their shape without going smooshy, and keep their skins intact. Add salt when beans are just barely tender: Adding the salt at the beginning of cooking can sometimes prevent the starches in the beans from breaking down, so they’ll be a little over-firm even after long cooking. The best time to add the salt is when the beans are almost finished cooking. When they are tender enough to eat but still too firm to really be enjoyable (aka, al dente), add the salt.",
            "idMeal": "11",
            "strCategory": "Githeri"
        },
        {
            "strFood": "Githeri",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2022/01/best-githeri-recipe.jpg",
            "strInstructions":  "Ingridients-Medium-sized paprika (also known as bell pepper, or pili pili hoho in Swahili)Chopped fresh cilantro (coriander) or parsley to garnish.cooking oil: I like to use olive oil but go ahead and use your favorite cooking oil, if you prefer.grains: boiled beans and maize (corn kernels).other vegetables: crushed garlic and ginger, one large chopped onion (feel free to use yellow or red onion), diced tomatoes, potatoes, a medium-sized carrot, chopped paprika (bell pepper, also known as pili pili hoho in Swahili).some tomato paste.seasoning: curry and cumin powder (optional), turmeric powder (also optional), garam masala, salt, one stock cube (such as Maggi or Knorr).liquids: some water.garnish: chopped fresh cilantro (coriander) to garnish.preparation:Heat cooking oil in a medium-sized pot or pan. Add the garlic and fry until fragrant. Fry for about one minute, taking care not to burn then stir in the ginger.Add the chopped onion and cook until it is slightly browned and fragrant then add in the diced tomatoes, tomato paste, curry and cumin powder, salt, and turmeric. Stir to combine.Next, add the potatoes, paprika (bell pepper), stock cube, and water, then stir. Cover and allow it to cook for about 10 minutes, or until the potatoes are slightly tender, but not entirely cooked through. Make sure to stir from time to time.Finally, add the boiled corn kernels (or maize), boiled beans, and garam masala then combine. Garnish with some chopped coriander (cilantro), serve and enjoy while still hot!",
            "idMeal": "12",
            "strCategory": "Githeri"
        },
        {
            "strFood": "Ndengu",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2022/05/simmer-garnish-and-serve.jpg",
            "strInstructions":  "INGRIDIENTS ndengu or mung beans) - While I cooked the ndengu from scratch for this recipe, feel free to use already boiled green grams from your local kiosk or market. Canned mung beans are also okay to use.minced garlic and ginger.an onion, tomatoes, bell pepper (optional), and some tomato paste.salt, one stock cube, turmeric, curry powder, and garam masala.some cooking oil and coconut milk.a handful of coriander stems and leaves.PREPARATION   Transfer your uncooked mung beans to a tray, and use your fingers to remove any unwanted debris, such as stones. Skip this step if using already-boiled mung beans (ndengu). Clean, then boil the green grams using water and the stock cube, until soft and tender.  Drain away any excess liquid and set the green grams aside. Heat some oil in a pot or pan and fry the onion until translucent and fragrant. Add the garlic, ginger, tomatoes, and coriander stems. Cook until the tomatoes soften.  Stir in the bell pepper (optional), salt, coconut milk, curry powder, and the rest of the spices.  Finally, add the ndengu and simmer until cooked. Garnish with some coriander leaves and serve!",
            "idMeal": "13",
            "strCategory": "Githeri"
        },
        {
            "strFood": "Chips Masala",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2022/09/masala-chips-recipe.jpg",
            "strInstructions":  "INGREDIENTS INGREDIENTS  ▢500 grams potato chips (fries) - feel free to use deep fried, oven chips, or French fries cooked using the air fryer. (approximately 1.1 pounds)▢2 tablespoon cooking oil▢1 medium-sized onion (peeled and finely diced)▢½ teaspoon curry powder▢½ teaspoon paprika powder (sweet or smoked is ok to use)▢1 tablespoon garlic (crushed or finely diced)▢1 tablespoon fresh ginger (crushed or finely diced)▢½ teaspoon cumin powder▢½ teaspoon garam masala▢½ teaspoon black pepper▢1 tablespoon tomato paste▢4 tablespoon tomato ketchup▢½ teaspoon salt (use more or less, to taste)▢2 small chilis (optional)- deseed the chilis if you prefer less heat or use them as they are, for more heat. (finely chopped - to garnish)▢a few stalks of coriander (cilantro) (finely chopped - to garnish)PREPARATION   Prepare the chips (French fries) according to your preferred method (bake, fry, or air fry). Gather the rest of the ingredients.Heat oil in a medium-sized pan or skillet, and fry the diced onion until translucent and fragrant. Next, mix in the spices and salt. Next, add the garlic, ginger, tomato paste, and tomato sauce (ketchup), then combine. Reduce the heat to a low, and allow this to simmer, stirring from time to time. You can add 1-2 extra tablespoons of cooking oil, ketchup, or water if the pan or skillet feels too dry.  Stir in the cooked chips or french fries and cook for a further few minutes. Garnish with sliced chilis (optional) and chopped coriander then serve. You can also garnish with chopped spring onion (scallions)",
            "idMeal": "14",
            "strCategory": "chips"
        },
        {
            "strFood": "Omena",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2022/07/omena-with-lemon.jpg",
            "strInstructions":  "INGREDIENTS  ▢2 cups dried omena fish▢2-3 small jugs hot water (or more, depending on how dirty your omena is)▢3-5 tablespoon cooking oil (plus a third a cup to briefly fry the omena)▢1 medium-sized onion (chopped)▢2 small cloves garlic (finely minced or crushed)▢3 medium-sized tomatoes (finely diced or blended)▢1½ teaspoon tomato paste▢1 medium-sized bell pepper (pili pili hoho)▢1 small diced chilli pepper or dried chili flakes (optional)▢1 teaspoon curry powder▢¾ teaspoon salt (or more to taste)▢⅓ cup water (optional - for the stew)▢one small bunch of coriander (cilantro) (chopped, leaves and stems separated)▢½ small lemonINSTRUCTIONS Place your omena on a kitchen tray and run your fingers through it, to check for stones, and any other unwanted debris such as shells.Use hot water to rinse your omena until clean. Next, using two cups of water, boil or soak your fish covered, for 10 minutes (see notes). Add more water if needed.2-3 small jugs hot water,2 cups dried omena fishUsing a sieve, drain the water and set the fish aside. In a pot or pan, heat oil under high heat. Add the sieved omena (dagaa) and fry for about 5 minutes, or until most of the liquid has dried up, stirring from time to time. Once done, set it aside in a bowl and prepare the stew.2 cups dried omena fish,3-5 tablespoon cooking oilUsing the same pot or pan, heat oil under medium heat then fry the onion until golden brown. Add the garlic and cook until fragrant. Next, add the coriander stems, curry powder, salt, chilli pepper or dried flakes, then stir to combine.3-5 tablespoon cooking oil,1 medium-sized onion,2 small cloves garlic,1 small diced chilli pepper or dried chili flakes,1 teaspoon curry powder,one small bunch of coriander (cilantro),¾ teaspoon saltAdd the tomatoes and tomato paste, stir, cover and allow the tomatoes to cook for about 10 minutes or until most of the water has evaporated and the tomatoes have softened.3 medium-sized tomatoes,1½ teaspoon tomato pasteStir in the fried omena and bell pepper. Add a third cup of water or more as preferred, if you like your omena to have the consistency of a stew. You can also use milk or coconut milk, instead of water. Cover, and allow it to simmer for a further 5 minutes.1 medium-sized bell pepper,⅓ cup waterOnce cooked, drizzle some lemon juice on top, and garnish with some chopped coriander (cilantro). Serve hot, with some ugali.one small bunch of coriander (cilantro),½ small lemon",
            "idMeal": "15",
            "strCategory": "Samaki"
        },
        {
            "strFood": "Bhajia",
            "strMealThumb": "https://keeshaskitchen.com/wp-content/uploads/2022/03/Kenyan-Bhajias-768x1152.jpg",
            "strInstructions":  "INGREDIENTS  Potatoes: These are the main ingredients for Bhajias. You can peel or not them, but it is essential to make sure you cut them into equal sizes to cook evenly.Gram Flour: This is also known as Besan and is made of chickpeas. It is used to make the batter for coating the potatoes.Water: The consistency of the batter should be like that of pancake mix. You may need to add more or less water depending on the flour you are using.Garlic Paste: Garlic gives the Bhajias a delicious flavor and aroma. You can either make your paste or buy it pre-made from the store.Minced Ginger: Ginger is another ingredient that contributes to the flavor of Bhajias. It can be fresh or ground, and you can add as much or as little as you like.Salt: Salt is a necessary ingredient in any dish, and it helps to bring out the flavors of the other ingredients.Paprika: This is an East African spice. It gives the Bhajias a nice reddish color and a spicy flavor.Green Chili Pepper: This is another ingredient that contributes to the dish’s spiciness. Depending on your taste preference, you can add as much or as little as you like.Cumin Powder: Cumin is also popular in Indian cuisine and adds an earthy flavor and color to the dish.Garam Masala: This is a mix of different spices, including cardamom, cinnamon, cloves, and black pepper. It gives the Bhajias an even more spicy flavor.Oil: The potatoes are fried in oil to become crispy and golden brown.Chopped Coriander: Coriander is a herb used in many Indian and East African dishes. It gives the Bhajias a fresh flavor and aroma.INSTRUCTIONS First, wash and peel the potatoes. Cut them into thin slices, and then set them aside.   In a bowl, mix together the gram flour, water, garlic paste, ginger paste, salt, paprika, green chili pepper, and cumin powder. Mix everything together.  Bring the oil to medium heat. Add the coated potatoes to the hot oil, and fry until they are golden brown.  Use a skimmer to remove them from the oil and place them in a paper-lined bowl to drain off any extra oil.  Serve and enjoy!",
            "idMeal": "16",
            "strCategory": "Chips"
        },
        {
            "strFood": "Samaki",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2022/03/swahili-samaki-wa-kupaka.jpg",
            "strInstructions":  "INGREDIENTS  Fish▢2 whole fish about 3-4 pounds or 2 kgs each (white snapper, red snapper, sea bass or king fishMarinade▢4 cloves garlic minced▢1 ginger (half a thumb size or approx. 2 cm - feel free to use more or less, according to taste)▢1 large bird eye chili finely sliced▢1 teaspoon turmeric powder▢3 tablespoon olive oil or your preferred choice of oil▢1 teaspoon garam masala optional▢1 teaspoon salt▢½ teaspoon black pepperSauce▢1-2 tablespoon olive oil or your preferred choice of oil▢1 can coconut cream (or about 1.5 litres)▢3 cloves garlic (minced or sliced)▢1 inch ginger (about 2.5 cm (fresh and ground) - feel free to use more or less, according to taste))▢1 bird eye chili (finely sliced)▢½ teaspoon black pepper▢¼ teaspoon cardamom ground▢2 tablespoon tamarind sauce alternatively, lime juice or lemon juice▢1 teaspoon turmeric powder▢1 teaspoon curry powder▢½ teaspoon salt (more if preferred)▢1 small lime sliced to wedges (optional - to garnish)INSTRUCTIONS Marinate the fishClean the fish by descaling it, removing the guts and washing it under running water. Use a kitchen cloth or paper towels to pat dry.Next, prepare the marinade by mixing minced garlic, ginger, turmeric powder, olive oil (or your preferred choice of oil), chili, garam masala, salt, and black pepper.4 cloves garlic,1 ginger,1 large bird eye chili,1 teaspoon turmeric powder,3 tablespoon olive oil,1 teaspoon garam masala,1 teaspoon salt,½ teaspoon black pepperLay the fish on a chopping board and use a sharp knife to make diagonal slits or cuts on each side of the fish. Using your hands or a spoon, spread a thick layer on both surfaces of the fish. Allow to marinade for at least 30 minutes (overnight in the refrigerator for best results). Make sure to apply some marinade in between the slits so it totally penetrates the fish.2 whole fishPrepare the sauceSet a skillet or a medium-sized pot on the stovetop under medium heat. (To save time, you can start grilling the fish while the sauce is still cooking).Next, add the oil, ginger, and garlic and fry for a minute. To the pot, add the black pepper, cardamom powder, turmeric powder, and curry powder then mix. Stir in the chili, salt, and coconut cream and simmer for about 15 minutes, stirring from time to time so it does not burn.1 large bird eye chili,1-2 tablespoon olive oil,1 can coconut cream,3 cloves garlic,1 bird eye chili,½ teaspoon black pepper,¼ teaspoon cardamom,1 teaspoon turmeric powder,1 teaspoon curry powder,½ teaspoon salt,1 inch gingerOnce the sauce is almost done, stir in the tamarind sauce and simmer for about a minute, switch off the heat, and cover it so it keeps warm.2 tablespoon tamarind sauceGrill the fishUse a brush to spread about a tablespoon of oil on the broiling rack or fish grilling basket. Place the marinated fish on a fish grill basket or on a suitable rack and grill both sides using a charcoal, or an electric grill for about 15 minutes (about 7 minutes on each side).To grill the fish on the broiler, preheat the broiler for about 10 minutes on high (the temperature should be about 480 degrees Fahrenheit or 250 degrees centigrade). Place the fish on a greased rack and position the rack about 3-5 inches (approx. 7-12cm) from the heat source.Once the fish is almost done, spoon or brush about 4-5 tablespoons of the sauce on each side of the fish and allow to grill for a further 1-2 minutes, or until the fish is almost cooked through and the juices run clear. This will also give the fish a lovely aroma. Take care not to overcook the fish, to prevent it from turning rubbery. The flesh of the fish should look flaky and opaque.To serve, transfer the fish to a large plate or platter. Spoon over the hot coconut sauce and arrange some sliced lime wedges on the side (optional). If you like, you can squeeze one or two wedges so the lime juice flows on top.1 small lime sliced to wedges",
            "idMeal": "17",
            "strCategory": "Samaki"
        },
        {
            "strFood": "Nyama Choma",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2021/05/nyama-choma-.jpg",
            "strInstructions":  "INGREDIENTS ▢5.5 lbs goat meat (approximately 2.5kgs) ▢10 cloves garlic ▢1 bulb whole garlic cut across in the middle ▢1 red or white onion large ▢1 lemon juiced ▢⅓ piece ginger ▢½ cup extra virgin olive oil or preferred cooking oil ▢1 tablespoon ground cumin ▢2 tablespoon ground paprika ▢1 tablespoon salt ▢2 stock cubes ▢6 sprigs fresh rosemary ▢2 bird-eye chillis de-seeded ▢1-2 tablespoon honey (optional - for basting) ▢2 tablespoon water INSTRUCTIONS   Prepare the marinade- in a bowl, combine garlic, ginger, onion, lemon juice, olive oil, cumin, paprika, salt, stock cubes, some rosemary, and chili. Use a food processor or blender, to save on time but take care not to process it too much. It should still retain some texture. 10 cloves garlic,1 red or white onion,1 lemon,⅓ piece ginger,½ cup extra virgin olive oil,1 tablespoon ground cumin,2 tablespoon ground paprika,1 tablespoon salt,2 stock cubes,6 sprigs fresh rosemary,2 bird-eye chillis Use a knife to make slits 2 inches or 5 cm apart on the goat leg. Transfer the meat to a bowl and toss it with half of the marinade. Set the other marinade aside, to be used in basting the nyama choma. Gashes on the surface of goat meat, in preparation for marination.  Remove the marinated goat meat from the fridge and allow it to come to room temperature for at least an hour, before setting it on the barbecue. During this time, prepare your grill and set it to high. Cover your grill with ashes if using a charcoal grill, to prevent it from getting too hot. Rub a few tablespoons of oil on a piece of aluminum foil then set it aside. Grill the meat on high for approximately 3 minutes on each side, or until it attains a proper color then transfer it to the prepared aluminum foil. Top it with the reserved marinade, then add more layers of aluminum foil at the bottom, so you end up with a triple layer. 5.5 lbs goat meat Place two sprigs of rosemary and the bulb of garlic on top of the goat leg. Cover the meat loosely with foil so it resembles a tent. 1 bulb whole garlic,6 sprigs fresh rosemary Add some water to a baking tray and place the meat on top of the baking tray (see notes below) Transfer it to the barbecue grill then cover the lid, trying to maintain the temperature at medium-low. Grill for one and a half hours, turning from time to time.   Once the time is up and the meat is almost done, mix the honey with 2-3 tablespoons of hot water to make a glaze. Uncover the meat and baste it with the honey glaze. Continue to grill for a further 15-30 minutes or until the desired brownness has been achieved and the juices run clear, or it has an internal temperature of at least 150-160 degrees F. 1-2 tablespoon honey,2 tablespoon water Once cooked, transfer the meat to a tray and allow it to rest for 10-20 minutes before carving. Serve nyama choma with ugali, sukuma wiki, and kachumbari, or your favourite dishes. OVEN METHOD To make nyama choma in the oven, simply marinate the meat and cover it with aluminum foil in preparation for roasting, as per the instructions above. Next, preheat the oven to 170° C/ 365° F (standard) or 150° C fan then lay the meat on a baking tray. Place in the oven and slowly roast for 4.5 hours. Once the cooking time is over, get the meat out of the oven and remove the aluminum foil. Make the glaze by mixing honey with 2-3 tablespoons of hot water. Uncover the meat and baste it with the honey glaze. Return the basted meat to the oven and broil each side on high for 5-10 minutes, or until the desired level of browness has been obtained. Remove the meat from the oven and allow it to cool for 20 minutes, before carving to prevent the juices from running out. Serve the nyama choma with mukimo, ugali, kachumbari or your favorite side dish.",
            "idMeal": "18",
            "strCategory": "Nyama"
        },
        {
            "strFood": "Mokimo",
            "strMealThumb": "https://npck.org/wp-content/uploads/2020/08/mukimo.jpg",
            "strInstructions":  "INGREDIENTS 1 kg Irish potatoes(select fresh for better taste) 2 handfuls of pumpkin leaves/spinach(soft and fresh) 3 cups of soft maize off the cob A bunch of spring onions(finely chopped) A spoonful of cooking oil Salt to taste    PREPARATION  Carefully peel the potatoes and slice them into halves, wash them clean and set aside. Prepare the pumpkin leaves by removing the stalk and shred them into sizeable pieces. You can also blend them for richer colour. lf you are using spinach you just need to shred a little bit as well. Mix the pumpkin leaves, maize and potatoes in a Sufuria and add some water. Just enough for everything to cook well. Place the Sufuria or cooking pot on fire and let the mixture boil for 30 minutes under medium heat. Open and add a pinch of salt and let it cook for 10 more minutes. Reduce the heat and mash everything together using a wooden spoon until all blends in well. Remove from. Heat and set aside. In another larger pot/Sufuria, pour in the spring onions and cooking oil and place on fire. Mix until the onions turn golden brown then adjust the heat to minimal and add the Mashed mixture. Mix well. You can now remove from the heat and serve while hot. Mukimo can be served with beef stew, chicken stew and Kachumbari on the side. A cold fruit juice will also come in handy.",
            "idMeal": "19",
            "strCategory": "main meal"
        },
        {
            "strFood": "kachumbari",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2020/04/Kachumbari-East-African-Salad-Recipe.jpg",
            "strInstructions":  " INGREDIENTS ▢3 medium-sized fresh tomatoes ▢¾ bulb onion medium sized ▢1 tablespoon salt ▢1 bunch cilantro (coriander) ▢½ lemon (or more, for a tangier taste) ▢1½ cups warm water ▢1-2 bird-eye chili (optional) INSTRUCTIONS   Wash the tomatoes then dry them using a clean kitchen towel. Peel the onion then use a knife to finely slice or dice. Next, add the warm water and a teaspoon of salt to a bowl and add the sliced onion inside. Stir then set aside and allow this to soak for at least 5 minutes. This helps get the sting out of the onions. Sliced onion soaked in a bowl of warm water. Finely slice or dice the tomatoes, cilantro (coriander), and bird-eye chili. Squeeze out the juice from the lemon and set this aside in a cup. Add tomatoes, coriander (cilantro), and the bird-eye chili (optional) to a medium-sized bowl. Using a sieve, discard excess water together with any excess salt from the onions. Add the onion to the bowl with the rest of the vegetables, then combine. Sliced kachumbari ingredients in a bowl Slowly add the lemon juice and keep tasting as you go. You can use more or less lemon juice as you prefer. Adjust for salt and let rest for at least 25 minutes. Serve your Kachumbari salad with grilled meat, vegetables, or your favorite side dish.",
            "idMeal": "21",
            "strCategory": "Nyama"
        },
        {
            "strFood": "Sukuma wiki",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2020/08/Sukuma-Wiki-Recipe-braised-collard-greens.jpg",
            "strInstructions":  " INGREDIENTS    ▢1 bunch sukuma wiki (collard greens) leaves (about 11/2 pounds or 700 grams) ▢2 medium-sized red tomatoes ▢½ small onion (white or red) ▢¼ cup olive oil (or preferred cooking oil) ▢salt to taste (you can also add some pepper but this is absolutely optional) INSTRUCTIONS   Wash the collard greens then use a knife to chop off the stems. You can also use your hands to separate the leaves from the stems. Discard the stems (you only require the leaves). Grab a bunch of leaves with your hand, roll them up together then hold them firmly on top of a chopping board. Use a knife to chop or slice into ribbons. The cutting size will depend on your preference. Wash the tomatoes, peel and slice the onion and chop the tomatoes. Next, heat your cooking pot on the stovetop set it to heat under medium heat. Next, add in the olive oil and allow it to heat for about 1-2 minutes. Fry the onion until golden brown. Next, add the tomatoes and allow them to cook. The tomatoes should be totally soft. You can add a tablespoon or two of oil, if the tomatoes are sticking to the pot. Once the tomatoes are totally cooked through, add the sukuma wiki leaves and some salt. Cover and allow it to reduce for about one minute then stir. Cover again and allow to cook for a further 5 minutes. You can cook it longer, if you do not like your vegetables crunchy. Season with more salt or some pepper (if preffered). Remove from the heat and serve with ugali. For a low carb or paleo option, serve sukuma wiki with low carb fufu. SUKUMA WIKI AND SPINACH RECIPE Wash the vegetables. Peel and slice the onion and chop the tomatoes. Next, heat your cooking pot on the stovetop and allow it to heat, under medium heat. Add the olive oil and heat for approximately 1-2 minutes. Fry the onion until golden brown and stir in the tomatoes then allow them to cook. The tomatoes should be totally soft. Add a tablespoon or two of oil, if the tomatoes are sticking to the pot. Once the tomatoes are totally cooked through, add the sukuma wiki leaves and the salt. Cover and allow the to reduce for about one minute then stir. Cover again and allow to cook for a further 5 minutes. Cook it longer, if you do not prefer your vegetables crunchy. Uncover the pot and add the spinach leaves. Stir and allow to cook for 1-2 minutes (cook longer if you prefer, but not longer than 5 minutes). Season with more salt if required then serve.",
            "idMeal": "22",
            "strCategory": "mboga"
        },
        {
            "strFood": "Sweet Potatoe",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2022/05/ninja-air-fryer-sweet-potato-cubes-360x450.jpg",
            "strInstructions":"INGREDIENTS  ▢3-4 medium-sized sweet potatoes. ▢¼ cup extra-virgin olive oil. ▢¾ teaspoon salt. ▢½ teaspoon freshly ground black pepper. ▢3 tablespoon honey (or maple syrup) - optional  INSTRUCTIONS   Clean and scrub the sweet potatoes under running water then peel (leave the skin on if you prefer). Trim off the ends of the sweet potatoes. Cut the sweet potato into 1-inch disks, and then into smaller cubes, about 1 inch in size. Transfer the cubed sweet potato to a large bowl. Add the olive oil, salt, and black pepper and ensure everything is well coated. 3-4 medium-sized sweet potatoes.,¼ cup extra-virgin olive oil.,¾ teaspoon salt.,½ teaspoon freshly ground black pepper. Transfer the sweet potato chunks to your air fryer basket, close, and air fry at 390°F (approximately 200°C) for 13-14 minutes. Avoid overcrowding; depending on the size of your air fryer, you may need to cook them in 2-3 batches. Check the sweet potatoes midway through cooking and shake your air fryer basket or carefully turn the potatoes using a spatula. Check for doneness by using a fork to press one cube of sweet potato on a plate. It should easily smush if cooked. Once cooked, transfer to a bowl and drizzle with honey, if using. 3 tablespoon honey For crispy and tender sweet potatoes, serve immediately (they turn softer as they cool).",
            "idMeal": "23",
            "strCategory": "mboga"
        },
        {
            "strFood": "Samosa",
            "strMealThumb": "https://static.toiimg.com/thumb/55453664.cms?imgsize=317782&width=800&height=800",
            "strInstructions":"INGREDIENTS  1/2 cup and 1 and 1/2 tablespoon all purpose flour 1/4 teaspoon cumin seeds 1/4 teaspoon ginger 1/4 teaspoon raisins 1 and 1/2 potato 1/4 teaspoon coriander powder 1/4 teaspoon red chilli powder 1/4 teaspoon kasoori methi leaves 1/4 teaspoon carom seeds 1 and 1/4 tablespoon water 1/2 cup and 1 and 1/2 tablespoon refined oil 1/4 teaspoon coriander seeds 1/4 teaspoon green chilli 1/4 teaspoon cashews 1/4 teaspoon cumin powder 1/4 teaspoon garam masala powder salt As required 1/4 teaspoon coriander leaves 1/2 tablespoon ghee 1/4 handful raw peanuts INSTRUCTIONS   To make samosas cripsy, make sure you knead a tight or stiff dough as the soft dough will not yield best results. Before kneading the dough, keep it in mind that you do not need to overwork it and mix the oil with flour at least 5-6 times. This will ensure you have crispy samosas. You should keep aside the dough for at least 40-60 minutes for best results. While rolling the dough ball, keep it thin and do not use any flour in it. You can use a little oil to roll the ball evenly. Always fry the samosas on low flame irrespective of how much time it is taking to fry. This will also ensure that your samosas are blisters free and cooked from inside.",
            "idMeal": "24",
            "strCategory": "chapati"
        },
        {
            "strFood": "Chai",
            "strMealThumb": "https://weeatatlast.com/wp-content/uploads/2021/02/Chai-ya-Tangawizi-African-Ginger-Tea-with-Milk-min.jpg",
            "strInstructions":"INGREDIENTS    ▢2 tablespoon black tea leaves ▢1 piece fresh ginger - sliced alternatively, a tablespoon of ground ginger ▢2 cups of your preferred choice of milk (plant milk or dairy) ▢2 cups water ▢sweetener or sugar to taste optional INSTRUCTIONS   Add water and sliced ginger pieces or ginger powder to a medium-sized pot and set it on the stovetop, under medium heat. Allow this to come to a boil, then add the milk. You want to keep an eye on the water-milk mixture to make sure it does not spill-over. Next, reduce the heat to a low, stir in the black tea leaves, then allow this to also come to a boil. Once boiled, switch off the heat, set the pot aside and pass the ginger tea through a sieve to separate the tea leaves, into a thermos flask or a pot. Pour into cups and serve hot.",
            "idMeal": "25",
            "strCategory": "chai"
        }
    ]
}